meta.org
#+TITLE: Meta-Notes
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2020-12-05T17:41:00-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ./index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="./css/stylesheet.css" />
# Created Saturday December  5, 2020 at  5:41PM

* Introduction
:PROPERTIES:
:CUSTOM_ID: h-b77abc9e-a0f0-4fe7-ae3d-676eb59a9572
:END:

Notes about these notes.

* Org-Mode
:PROPERTIES:
:CUSTOM_ID: h-7f8de6e0-3c75-41af-9ee7-c3e744608219
:END:

Regarding org-mode commands and quirks.

** LaTeX Macros
:PROPERTIES:
:CUSTOM_ID: h-658f4d38-0e83-46c9-bac0-84a19b4f59ca
:END:

I follow this general scheme when adding more LaTeX macros to my
~org-macros.org~ file: add them to a ~latex-macros~ source code
environment, add the following lines to my =~/.emacs.d/init.el= file:

#+begin_src elisp
(add-to-list 'org-src-lang-modes '("latex-macros" . latex))

(defvar org-babel-default-header-args:latex-macros
  '((:results . "raw")
    (:exports . "results")))

(defun prefix-all-lines (pre body)
  (with-temp-buffer
    (insert body)
    (string-insert-rectangle (point-min) (point-max) pre)
    (buffer-string)))

(defun org-babel-execute:latex-macros (body _params)
  (concat
   (prefix-all-lines "#+LATEX_HEADER: " body)
   "\n#+HTML_HEAD_EXTRA: <div style=\"display: none\"> \\(\n"
   (prefix-all-lines "#+HTML_HEAD_EXTRA: " body)
   "\n#+HTML_HEAD_EXTRA: \\)</div>\n"))
#+end_src

** Exporting Source code
:PROPERTIES:
:CUSTOM_ID: h-2b8b062a-7c16-48f8-a118-245121b4d2d5
:END:

If I add to the header of an org file:

#+begin_example
 #+begin_src lang tangle: my-file.lisp ...
#+end_example

Then by default, all source code blocks will be evaluated /as if/
it had =tangle: my-file.lisp=.

*** Keeping the Noweb labels in documentation
:PROPERTIES:
:CUSTOM_ID: h-8fa1669d-3c91-4589-a8e6-bbaa1aad1bd3
:END:

If we want to keep the noweb labels inlined in the code blocks when
exporting to HTML or whatever, then we should also add:

#+begin_example
 #+begin_src lang :noweb no-export ...
#+end_example

It appears that the Noweb label can include whitespace, though it
may be useful to use =snake_case=. When we want to define or append
code to a noweb label, we write

#+begin_example
 #+begin_src lang ... :noweb-ref [label]
#+end_example

It seems like it must be the last element in the "begin source"
line.

** Custom Environments ("Blocks")
:PROPERTIES:
:CUSTOM_ID: h-35670114-2619-423e-96e0-8e346dfa7f42
:END:

I can add custom blocks and shortcuts to expand =<xxx= into blocks
with the following elisp:

#+begin_src elisp
(require 'org-tempo)
(setq org-structure-template-alist '(("a" . "export ascii")
                                     ("c" . "center")
                                     ("C" . "comment")
                                     ("e" . "example")
                                     ("E" . "export")
                                     ("h" . "export html")
                                     ("l" . "export latex")
                                     ("q" . "quote")
                                     ("s" . "src")
                                     ("v" . "verse")
                                     ("rmk" . "remark")
                                     ("cor" . "corollary")
                                     ("thm" . "theorem")
                                     ("prop" . "proposition")
                                     ("lem" . "lemma")
                                     ("pz" . "puzzle")
                                     ("xca" . "exercise")
                                     ("ex" . "math-example")
                                     ("eg" . "math-example")
                                     ("d" . "definition")
                                     ("dan" . "danger")
                                     ("pf" . "proof")))
#+end_src

