docs/meta.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-11 Sun 12:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Meta-Notes</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="stylesheet" type="text/css" href="./css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Meta-Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-b77abc9e-a0f0-4fe7-ae3d-676eb59a9572">1. Introduction</a></li>
<li><a href="#h-7f8de6e0-3c75-41af-9ee7-c3e744608219">2. Org-Mode</a>
<ul>
<li><a href="#h-658f4d38-0e83-46c9-bac0-84a19b4f59ca">2.1. LaTeX Macros</a></li>
<li><a href="#h-2b8b062a-7c16-48f8-a118-245121b4d2d5">2.2. Exporting Source code</a>
<ul>
<li><a href="#h-8fa1669d-3c91-4589-a8e6-bbaa1aad1bd3">2.2.1. Keeping the Noweb labels in documentation</a></li>
</ul>
</li>
<li><a href="#h-35670114-2619-423e-96e0-8e346dfa7f42">2.3. Custom Environments ("Blocks")</a></li>
<li><a href="#h-699a0f36-f66e-49f8-8001-0d539adb2b08">2.4. Publishing</a></li>
<li><a href="#h-6f991225-0777-4b81-95aa-eb263d48d74b">2.5. Org-ids</a></li>
<li><a href="#h-16b0b61f-f28c-41da-aa14-65642a57bd35">2.6. Color Choices</a></li>
</ul>
</li>
<li><a href="#h-1aab71f2-8e65-453b-966e-a37e2e670ca5">3. Subject Classification</a>
<ul>
<li><a href="#h-6075edee-bacb-4aae-8981-c099d184437b">3.1. Mathematical Subject Classification</a></li>
<li><a href="#h-35217069-957b-49ab-b033-dadebc98f45b">3.2. Physics and Astronomy Classification System</a></li>
<li><a href="#h-3c1b1968-8d08-462b-aa40-be56a104cb01">3.3. ACM Computing Classification System</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-b77abc9e-a0f0-4fe7-ae3d-676eb59a9572" class="outline-2">
<h2 id="h-b77abc9e-a0f0-4fe7-ae3d-676eb59a9572"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-h-b77abc9e-a0f0-4fe7-ae3d-676eb59a9572">
<p>
Notes about these notes.
</p>
</div>
</div>

<div id="outline-container-h-7f8de6e0-3c75-41af-9ee7-c3e744608219" class="outline-2">
<h2 id="h-7f8de6e0-3c75-41af-9ee7-c3e744608219"><span class="section-number-2">2</span> Org-Mode</h2>
<div class="outline-text-2" id="text-h-7f8de6e0-3c75-41af-9ee7-c3e744608219">
<p>
Regarding org-mode commands and quirks.
</p>
</div>

<div id="outline-container-h-658f4d38-0e83-46c9-bac0-84a19b4f59ca" class="outline-3">
<h3 id="h-658f4d38-0e83-46c9-bac0-84a19b4f59ca"><span class="section-number-3">2.1</span> LaTeX Macros</h3>
<div class="outline-text-3" id="text-h-658f4d38-0e83-46c9-bac0-84a19b4f59ca">
<p>
I follow this general scheme when adding more LaTeX macros to my
<code>org-macros.org</code> file: add them to a <code>latex-macros</code> source code
environment, add the following lines to my <code>~/.emacs.d/init.el</code> file:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'org-src-lang-modes '(<span class="org-string">"latex-macros"</span> . latex))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">org-babel-default-header-args:latex-macros</span>
  '((<span class="org-builtin">:results</span> . <span class="org-string">"raw"</span>)
    (<span class="org-builtin">:exports</span> . <span class="org-string">"results"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">prefix-all-lines</span> (pre body)
  (<span class="org-keyword">with-temp-buffer</span>
    (insert body)
    (string-insert-rectangle (point-min) (point-max) pre)
    (buffer-string)))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-babel-execute:latex-macros</span> (body _params)
  (concat
   (prefix-all-lines <span class="org-string">"#+LATEX_HEADER: "</span> body)
   <span class="org-string">"\n#+HTML_HEAD_EXTRA: &lt;div style=\"display: none\"&gt; </span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\n"</span>
   (prefix-all-lines <span class="org-string">"#+HTML_HEAD_EXTRA: "</span> body)
   <span class="org-string">"\n#+HTML_HEAD_EXTRA: </span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">&lt;/div&gt;\n"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-h-2b8b062a-7c16-48f8-a118-245121b4d2d5" class="outline-3">
<h3 id="h-2b8b062a-7c16-48f8-a118-245121b4d2d5"><span class="section-number-3">2.2</span> Exporting Source code</h3>
<div class="outline-text-3" id="text-h-2b8b062a-7c16-48f8-a118-245121b4d2d5">
<p>
If I add to the header of an org file:
</p>

<pre class="example" id="org37a1928">
 #+begin_src lang tangle: my-file.lisp ...
</pre>

<p>
Then by default, all source code blocks will be evaluated <i>as if</i>
it had <code>tangle: my-file.lisp</code>.
</p>
</div>

<div id="outline-container-h-8fa1669d-3c91-4589-a8e6-bbaa1aad1bd3" class="outline-4">
<h4 id="h-8fa1669d-3c91-4589-a8e6-bbaa1aad1bd3"><span class="section-number-4">2.2.1</span> Keeping the Noweb labels in documentation</h4>
<div class="outline-text-4" id="text-h-8fa1669d-3c91-4589-a8e6-bbaa1aad1bd3">
<p>
If we want to keep the noweb labels inlined in the code blocks when
exporting to HTML or whatever, then we should also add:
</p>

<pre class="example" id="org006b278">
 #+begin_src lang :noweb no-export ...
</pre>

<p>
It appears that the Noweb label can include whitespace, though it
may be useful to use <code>snake_case</code>. When we want to define or append
code to a noweb label, we write
</p>

<pre class="example" id="org118d4f3">
 #+begin_src lang ... :noweb-ref [label]
</pre>

<p>
It seems like it must be the last element in the "begin source"
line.
</p>
</div>
</div>
</div>

<div id="outline-container-h-35670114-2619-423e-96e0-8e346dfa7f42" class="outline-3">
<h3 id="h-35670114-2619-423e-96e0-8e346dfa7f42"><span class="section-number-3">2.3</span> Custom Environments ("Blocks")</h3>
<div class="outline-text-3" id="text-h-35670114-2619-423e-96e0-8e346dfa7f42">
<p>
I can add custom blocks and shortcuts to expand <code>&lt;xxx</code> into blocks
with the following elisp:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">require</span> '<span class="org-constant">org-tempo</span>)
(<span class="org-keyword">setq</span> org-structure-template-alist '((<span class="org-string">"a"</span> . <span class="org-string">"export ascii"</span>)
                                     (<span class="org-string">"c"</span> . <span class="org-string">"center"</span>)
                                     (<span class="org-string">"C"</span> . <span class="org-string">"comment"</span>)
                                     (<span class="org-string">"e"</span> . <span class="org-string">"example"</span>)
                                     (<span class="org-string">"E"</span> . <span class="org-string">"export"</span>)
                                     (<span class="org-string">"h"</span> . <span class="org-string">"export html"</span>)
                                     (<span class="org-string">"l"</span> . <span class="org-string">"export latex"</span>)
                                     (<span class="org-string">"q"</span> . <span class="org-string">"quote"</span>)
                                     (<span class="org-string">"s"</span> . <span class="org-string">"src"</span>)
                                     (<span class="org-string">"v"</span> . <span class="org-string">"verse"</span>)
                                     (<span class="org-string">"rmk"</span> . <span class="org-string">"remark"</span>)
                                     (<span class="org-string">"cor"</span> . <span class="org-string">"corollary"</span>)
                                     (<span class="org-string">"thm"</span> . <span class="org-string">"theorem"</span>)
                                     (<span class="org-string">"prop"</span> . <span class="org-string">"proposition"</span>)
                                     (<span class="org-string">"lem"</span> . <span class="org-string">"lemma"</span>)
                                     (<span class="org-string">"pz"</span> . <span class="org-string">"puzzle"</span>)
                                     (<span class="org-string">"xca"</span> . <span class="org-string">"exercise"</span>)
                                     (<span class="org-string">"ex"</span> . <span class="org-string">"math-example"</span>)
                                     (<span class="org-string">"eg"</span> . <span class="org-string">"math-example"</span>)
                                     (<span class="org-string">"d"</span> . <span class="org-string">"definition"</span>)
                                     (<span class="org-string">"dan"</span> . <span class="org-string">"danger"</span>)
                                     (<span class="org-string">"pf"</span> . <span class="org-string">"proof"</span>)))
</pre>
</div>
</div>
</div>
