meta.org
** Publishing
:PROPERTIES:
:CUSTOM_ID: h-699a0f36-f66e-49f8-8001-0d539adb2b08
:END:

I'd need to add to my =~/.emacs= file

#+begin_src elisp
(require 'ox-publish)
(setq org-publish-project-alist '())
(add-to-list 'org-publish-project-alist
      '("org-notes"
         :base-directory "~/org-notes/"
         :base-extension "org"
         :publishing-directory "~/org-notes/html/"
         :recursive t
         :publishing-function org-html-publish-to-html
         :exclude "\\(html\\|ignore\\)/"
         ))

(add-to-list 'org-publish-project-alist
        '("org-static"
        :base-directory "~/org-notes/"
        :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
        :publishing-directory "~/org-notes/html/"
        :recursive t
        :publishing-function org-publish-attachment
        :exclude "\\(html\\|ignore\\)/"
        ))

(add-to-list 'org-publish-project-alist
             '("all" :components ("all-notes" "org-static")))
#+end_src

We avoid writing the postamble:

#+begin_src elisp
(eval-after-load "ox-html" (setq org-html-postamble nil))
#+end_src

And we can permit evaluating source blocks automatically:

#+begin_src elisp
(setq org-confirm-babel-evaluate nil) ; don't ask for confirmation before evaluating a code block
(setq org-export-babel-evaluate t)
(setq org-export-use-babel t)
#+end_src

