docs/meta.html

<div id="outline-container-h-699a0f36-f66e-49f8-8001-0d539adb2b08" class="outline-3">
<h3 id="h-699a0f36-f66e-49f8-8001-0d539adb2b08"><span class="section-number-3">2.4</span> Publishing</h3>
<div class="outline-text-3" id="text-h-699a0f36-f66e-49f8-8001-0d539adb2b08">
<p>
I'd need to add to my <code>~/.emacs</code> file
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">require</span> '<span class="org-constant">ox-publish</span>)
(<span class="org-keyword">setq</span> org-publish-project-alist '())
(add-to-list 'org-publish-project-alist
      '(<span class="org-string">"org-notes"</span>
         <span class="org-builtin">:base-directory</span> <span class="org-string">"~/org-notes/"</span>
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"~/org-notes/html/"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:exclude</span> <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">html</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">ignore</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">/"</span>
         ))

(add-to-list 'org-publish-project-alist
        '(<span class="org-string">"org-static"</span>
        <span class="org-builtin">:base-directory</span> <span class="org-string">"~/org-notes/"</span>
        <span class="org-builtin">:base-extension</span> <span class="org-string">"css</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">js</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">png</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">jpg</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">gif</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">pdf</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">mp3</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">ogg</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">swf"</span>
        <span class="org-builtin">:publishing-directory</span> <span class="org-string">"~/org-notes/html/"</span>
        <span class="org-builtin">:recursive</span> t
        <span class="org-builtin">:publishing-function</span> org-publish-attachment
        <span class="org-builtin">:exclude</span> <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">html</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">ignore</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">/"</span>
        ))

(add-to-list 'org-publish-project-alist
             '(<span class="org-string">"all"</span> <span class="org-builtin">:components</span> (<span class="org-string">"all-notes"</span> <span class="org-string">"org-static"</span>)))
</pre>
</div>

<p>
We avoid writing the postamble:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(eval-after-load <span class="org-string">"ox-html"</span> (<span class="org-keyword">setq</span> org-html-postamble nil))
</pre>
</div>

<p>
And we can permit evaluating source blocks automatically:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">setq</span> org-confirm-babel-evaluate nil) <span class="org-comment-delimiter">; </span><span class="org-comment">don't ask for confirmation before evaluating a code block</span>
(<span class="org-keyword">setq</span> org-export-babel-evaluate t)
(<span class="org-keyword">setq</span> org-export-use-babel t)
</pre>
</div>
</div>
</div>
