meta.org
** Org-ids
:PROPERTIES:
:CUSTOM_ID: h-6f991225-0777-4b81-95aa-eb263d48d74b
:END:

When publishing, org-ids are generated by timestamp (at the time of
publishing), so although a page may not substantively change, it
republishes erroneously. I looked to fix this, and found [[https://writequit.org/articles/emacs-org-mode-generate-ids.html][Lee Hinman wrote a solution]]:

#+begin_src elisp
(require 'org-id)
(setq org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id)

(defun eos/org-custom-id-get (&optional pom create prefix)
  "Get the CUSTOM_ID property of the entry at point-or-marker POM.
   If POM is nil, refer to the entry at point. If the entry does
   not have an CUSTOM_ID, the function returns nil. However, when
   CREATE is non nil, create a CUSTOM_ID if none is present
   already. PREFIX will be passed through to `org-id-new'. In any
   case, the CUSTOM_ID of the entry is returned."
  (interactive)
  (org-with-point-at pom
    (let ((id (org-entry-get nil "CUSTOM_ID")))
      (cond
       ((and id (stringp id) (string-match "\\S-" id))
        id)
       (create
        (setq id (org-id-new (concat prefix "h")))
        (org-entry-put pom "CUSTOM_ID" id)
        (org-id-add-location id (buffer-file-name (buffer-base-buffer)))
        id)))))

(defun eos/org-add-ids-to-headlines-in-file ()
  "Add CUSTOM_ID properties to all headlines in the
   current file which do not already have one."
  (interactive)
  (org-map-entries (lambda () (eos/org-custom-id-get (point) 'create))))

;; automatically add ids to saved org-mode headlines
(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'before-save-hook
                      (lambda ()
                        (when (and (eq major-mode 'org-mode)
                                   (eq buffer-read-only nil))
                          (eos/org-add-ids-to-headlines-in-file))))))

(defun org-id-new (&optional prefix)
  "Create a new globally unique ID.

An ID consists of two parts separated by a colon:
- a prefix
- a unique part that will be created according to `org-id-method'.

PREFIX can specify the prefix, the default is given by the variable
`org-id-prefix'.  However, if PREFIX is the symbol `none', don't use any
prefix even if `org-id-prefix' specifies one.

So a typical ID could look like \"Org-4nd91V40HI\"."
  (let* ((prefix (if (eq prefix 'none)
                     ""
                   (concat (or prefix org-id-prefix) "-")))
         unique)
    (if (equal prefix "-") (setq prefix ""))
    (cond
     ((memq org-id-method '(uuidgen uuid))
      (setq unique (org-trim (shell-command-to-string org-id-uuid-program)))
      (unless (org-uuidgen-p unique)
        (setq unique (org-id-uuid))))
     ((eq org-id-method 'org)
      (let* ((etime (org-reverse-string (org-id-time-to-b36)))
             (postfix (if org-id-include-domain
                          (progn
                            (require 'message)
                            (concat "@" (message-make-fqdn))))))
        (setq unique (concat etime postfix))))
     (t (error "Invalid `org-id-method'")))
    (concat prefix unique)))
#+end_src

** Color Choices
:PROPERTIES:
:CUSTOM_ID: h-16b0b61f-f28c-41da-aa14-65642a57bd35
:END:

I've used syntax highlighting based off of Github's style. In my
=~/.emacs.d/init.el= file, I've got:

#+begin_src elisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((scheme . t)
   (emacs-lisp . t)
   (lisp . t)
   (C . t)))

(setq org-html-htmlize-output-type 'css) ; export HTML classes & css syling
(setq org-html-htmlize-font-prefix "org-")
(setq org-src-preserve-indentation t)
(setq org-src-fontify-natively t) ; export syntax highlighting
#+end_src

This setup permits overriding the style using a CSS file, prefixing all
the element classes with ~org-*~.

Sarah Rovner-Frydman uses the following color schema:

#+begin_quote
set recolor-darkcolor ~"#B0C6D7"~
set recolor-lightcolor ~"#141D26"~
#+end_quote

I am using PT serif for my main font, Sans Serif Code for the teletype
font,


* Subject Classification
:PROPERTIES:
:CUSTOM_ID: h-1aab71f2-8e65-453b-966e-a37e2e670ca5
:END:

I'm not sure how best to organize my notes. There are a number of
classification systems for the subjects I am interested in studying.
These are too coarse, not quite right, but interesting
nevertheless, so I'm sticking them in my meta-notes.

** Mathematical Subject Classification
:PROPERTIES:
:CUSTOM_ID: h-6075edee-bacb-4aae-8981-c099d184437b
:END:

- General, foundations
- Discrete mathematics, algebra
- Analysis
- Geometry and Topology
- Applied mathematics, other

** Physics and Astronomy Classification System
:PROPERTIES:
:CUSTOM_ID: h-35217069-957b-49ab-b033-dadebc98f45b
:END:

- General
- The Physics of Elementary Particles and Fields
- Nuclear Physics
- Atomic and Molecular Physics
- Electromagnetism, Optics, Acoustics, Heat Transfer, Classical
  Mechanics, and Fluid Dynamics
- Physics of Gases, Plasmas, and Electric Discharges
- Condensed Matter: Structure, Mechanical and Thermal Properties
- Condensed Matter: Electronic Structure, Electrical, Magnetic, and
  Optical Properties
- Interdisciplinary Physics and Related Areas of Science and Technology
- Geophysics, Astronomy, and Astrophysics

