docs/meta.html

<div id="outline-container-h-6f991225-0777-4b81-95aa-eb263d48d74b" class="outline-3">
<h3 id="h-6f991225-0777-4b81-95aa-eb263d48d74b"><span class="section-number-3">2.5</span> Org-ids</h3>
<div class="outline-text-3" id="text-h-6f991225-0777-4b81-95aa-eb263d48d74b">
<p>
When publishing, org-ids are generated by timestamp (at the time of
publishing), so although a page may not substantively change, it
republishes erroneously. I looked to fix this, and found <a href="https://writequit.org/articles/emacs-org-mode-generate-ids.html">Lee Hinman wrote a solution</a>:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">require</span> '<span class="org-constant">org-id</span>)
(<span class="org-keyword">setq</span> org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id)

(<span class="org-keyword">defun</span> <span class="org-function-name">eos/org-custom-id-get</span> (<span class="org-type">&amp;optional</span> pom create prefix)
  <span class="org-doc">"Get the CUSTOM_ID property of the entry at point-or-marker POM.</span>
<span class="org-doc">   If POM is nil, refer to the entry at point. If the entry does</span>
<span class="org-doc">   not have an CUSTOM_ID, the function returns nil. However, when</span>
<span class="org-doc">   CREATE is non nil, create a CUSTOM_ID if none is present</span>
<span class="org-doc">   already. PREFIX will be passed through to `</span><span class="org-doc"><span class="org-constant">org-id-new</span></span><span class="org-doc">'. In any</span>
<span class="org-doc">   case, the CUSTOM_ID of the entry is returned."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">org-with-point-at</span> pom
    (<span class="org-keyword">let</span> ((id (org-entry-get nil <span class="org-string">"CUSTOM_ID"</span>)))
      (<span class="org-keyword">cond</span>
       ((<span class="org-keyword">and</span> id (stringp id) (string-match <span class="org-string">"\\S-"</span> id))
        id)
       (create
        (<span class="org-keyword">setq</span> id (org-id-new (concat prefix <span class="org-string">"h"</span>)))
        (org-entry-put pom <span class="org-string">"CUSTOM_ID"</span> id)
        (org-id-add-location id (buffer-file-name (buffer-base-buffer)))
        id)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">eos/org-add-ids-to-headlines-in-file</span> ()
  <span class="org-doc">"Add CUSTOM_ID properties to all headlines in the</span>
<span class="org-doc">   current file which do not already have one."</span>
  (<span class="org-keyword">interactive</span>)
  (org-map-entries (<span class="org-keyword">lambda</span> () (eos/org-custom-id-get (point) 'create))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">automatically add ids to saved org-mode headlines</span>
(add-hook 'org-mode-hook
          (<span class="org-keyword">lambda</span> ()
            (add-hook 'before-save-hook
                      (<span class="org-keyword">lambda</span> ()
                        (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (eq major-mode 'org-mode)
                                   (eq buffer-read-only nil))
                          (eos/org-add-ids-to-headlines-in-file))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-id-new</span> (<span class="org-type">&amp;optional</span> prefix)
  <span class="org-doc">"Create a new globally unique ID.</span>

<span class="org-doc">An ID consists of two parts separated by a colon:</span>
<span class="org-doc">- a prefix</span>
<span class="org-doc">- a unique part that will be created according to `</span><span class="org-doc"><span class="org-constant">org-id-method</span></span><span class="org-doc">'.</span>

<span class="org-doc">PREFIX can specify the prefix, the default is given by the variable</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">org-id-prefix</span></span><span class="org-doc">'.  However, if PREFIX is the symbol `</span><span class="org-doc"><span class="org-constant">none</span></span><span class="org-doc">', don't use any</span>
<span class="org-doc">prefix even if `</span><span class="org-doc"><span class="org-constant">org-id-prefix</span></span><span class="org-doc">' specifies one.</span>

<span class="org-doc">So a typical ID could look like \"Org-4nd91V40HI\"."</span>
  (<span class="org-keyword">let*</span> ((prefix (<span class="org-keyword">if</span> (eq prefix 'none)
                     <span class="org-string">""</span>
                   (concat (<span class="org-keyword">or</span> prefix org-id-prefix) <span class="org-string">"-"</span>)))
         unique)
    (<span class="org-keyword">if</span> (equal prefix <span class="org-string">"-"</span>) (<span class="org-keyword">setq</span> prefix <span class="org-string">""</span>))
    (<span class="org-keyword">cond</span>
     ((memq org-id-method '(uuidgen uuid))
      (<span class="org-keyword">setq</span> unique (org-trim (shell-command-to-string org-id-uuid-program)))
      (<span class="org-keyword">unless</span> (org-uuidgen-p unique)
        (<span class="org-keyword">setq</span> unique (org-id-uuid))))
     ((eq org-id-method 'org)
      (<span class="org-keyword">let*</span> ((etime (org-reverse-string (org-id-time-to-b36)))
             (postfix (<span class="org-keyword">if</span> org-id-include-domain
                          (<span class="org-keyword">progn</span>
                            (<span class="org-keyword">require</span> '<span class="org-constant">message</span>)
                            (concat <span class="org-string">"@"</span> (message-make-fqdn))))))
        (<span class="org-keyword">setq</span> unique (concat etime postfix))))
     (t (<span class="org-warning">error</span> <span class="org-string">"Invalid `</span><span class="org-string"><span class="org-constant">org-id-method</span></span><span class="org-string">'"</span>)))
    (concat prefix unique)))
</pre>
</div>
</div>
</div>

<div id="outline-container-h-16b0b61f-f28c-41da-aa14-65642a57bd35" class="outline-3">
<h3 id="h-16b0b61f-f28c-41da-aa14-65642a57bd35"><span class="section-number-3">2.6</span> Color Choices</h3>
<div class="outline-text-3" id="text-h-16b0b61f-f28c-41da-aa14-65642a57bd35">
<p>
I've used syntax highlighting based off of Github's style. In my
<code>~/.emacs.d/init.el</code> file, I've got:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((scheme . t)
   (emacs-lisp . t)
   (lisp . t)
   (C . t)))

(<span class="org-keyword">setq</span> org-html-htmlize-output-type 'css) <span class="org-comment-delimiter">; </span><span class="org-comment">export HTML classes &amp; css syling</span>
(<span class="org-keyword">setq</span> org-html-htmlize-font-prefix <span class="org-string">"org-"</span>)
(<span class="org-keyword">setq</span> org-src-preserve-indentation t)
(<span class="org-keyword">setq</span> org-src-fontify-natively t) <span class="org-comment-delimiter">; </span><span class="org-comment">export syntax highlighting</span>
</pre>
</div>

<p>
This setup permits overriding the style using a CSS file, prefixing all
the element classes with <code>org-*</code>.
</p>

<p>
Sarah Rovner-Frydman uses the following color schema:
</p>

<blockquote>
<p>
set recolor-darkcolor <code>"#B0C6D7"</code>
set recolor-lightcolor <code>"#141D26"</code>
</p>
</blockquote>

<p>
I am using PT serif for my main font, Sans Serif Code for the teletype
font,
</p>
</div>
</div>
</div>


<div id="outline-container-h-1aab71f2-8e65-453b-966e-a37e2e670ca5" class="outline-2">
<h2 id="h-1aab71f2-8e65-453b-966e-a37e2e670ca5"><span class="section-number-2">3</span> Subject Classification</h2>
<div class="outline-text-2" id="text-h-1aab71f2-8e65-453b-966e-a37e2e670ca5">
<p>
I'm not sure how best to organize my notes. There are a number of
classification systems for the subjects I am interested in studying.
These are too coarse, not quite right, but interesting
nevertheless, so I'm sticking them in my meta-notes.
</p>
</div>

<div id="outline-container-h-6075edee-bacb-4aae-8981-c099d184437b" class="outline-3">
<h3 id="h-6075edee-bacb-4aae-8981-c099d184437b"><span class="section-number-3">3.1</span> Mathematical Subject Classification</h3>
<div class="outline-text-3" id="text-h-6075edee-bacb-4aae-8981-c099d184437b">
<ul class="org-ul">
<li>General, foundations</li>
<li>Discrete mathematics, algebra</li>
<li>Analysis</li>
<li>Geometry and Topology</li>
<li>Applied mathematics, other</li>
</ul>
</div>
</div>

<div id="outline-container-h-35217069-957b-49ab-b033-dadebc98f45b" class="outline-3">
<h3 id="h-35217069-957b-49ab-b033-dadebc98f45b"><span class="section-number-3">3.2</span> Physics and Astronomy Classification System</h3>
<div class="outline-text-3" id="text-h-35217069-957b-49ab-b033-dadebc98f45b">
<ul class="org-ul">
<li>General</li>
<li>The Physics of Elementary Particles and Fields</li>
<li>Nuclear Physics</li>
<li>Atomic and Molecular Physics</li>
<li>Electromagnetism, Optics, Acoustics, Heat Transfer, Classical
Mechanics, and Fluid Dynamics</li>
<li>Physics of Gases, Plasmas, and Electric Discharges</li>
<li>Condensed Matter: Structure, Mechanical and Thermal Properties</li>
<li>Condensed Matter: Electronic Structure, Electrical, Magnetic, and
Optical Properties</li>
<li>Interdisciplinary Physics and Related Areas of Science and Technology</li>
<li>Geophysics, Astronomy, and Astrophysics</li>
</ul>
</div>
</div>
